In [1]:
import pandas as pd

### Dict

In [2]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [6]:
df = df[['name', 'age', 'job']]

In [7]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

### OrderedDict
- key의 순서를 보장

In [8]:
from collections import OrderedDict

In [11]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [14]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [15]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [16]:
df = pd.DataFrame(friend_ordered_dict)

In [17]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

### List

In [18]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [19]:
column_name = ['name', 'age', 'job']

In [20]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [21]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [22]:
df = pd.DataFrame(friend_list, columns = column_name)

In [23]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [24]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]

In [25]:
df = pd.DataFrame(friend_list)

In [26]:
df

      0                   1
0  name        [John, Nate]
1   age            [20, 30]
2   job  [student, teacher]

In [27]:
df = pd.DataFrame.from_records(friend_list)

In [28]:
df

      0                   1
0  name        [John, Nate]
1   age            [20, 30]
2   job  [student, teacher]

In [29]:
df = pd.DataFrame.from_items(friend_list)

c:\users\jju_park\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [30]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [32]:
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [33]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher